CantileverBeam/preliminaryGroundMotion/RunCase/OpenFOAMCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*| =========											    ____/_________\____	 _.*_*.			    |
| \	  /	  F ield          |   |  S tructural     ||__|/\|___|/\|__||	  \ \ \.		    |
|  \	 /    O peration      |___|  E ngineering &  ||__|/\|___|/\|__||	   | | | \._		|
|   \  /     A nd                |  E arthquake     ||__|/\|___|/\|__||	  _/_/_/ | .\.__... |
|	 \/      M anipulation   |___|  S imulation     ||__|/\|___|/\|__||   __/, / _ \___...	    |
|____________________________________________________||  |/\| | |/\|  ||__/,_/__,_____/...______|
	\*---------------------------------------------------------------------------*/
	FoamFile{
		version	 2.0;
		format	  ascii;
		class	   dictionary;
		location	"system";
		object	  controlDict;
	}
	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	libs
	(
		"libOpenFOAM.so"
		"libforces.so"
		"libOpenFOAM.so"
	);
	
	application	 interFoam;

	startFrom	   latestTime;
	
	startTime	   0.0;

	stopAt		  endTime;

	endTime		 1.0;

	deltaT		  0.0001;

	writeControl	adjustable;

	writeInterval   0.1;

	writeFormat	 ascii;

	writePrecision  6;

	writeCompression off;

	timeFormat	  general;

	timePrecision   12;

	runTimeModifiable no;
	adjustTimeStep no;

	DebugSwitches
	{
	  level	2;
	  lduMatrix 2;
	  libs 2;
	}
	OptimisationSwitches
	{
	fileHandler uncollated;
	maxThreadFileBufferSize 5e9; // v1712 default is 0;
	maxMasterFileBufferSize 5e9;
	}


	maxCo		   0.5;
	maxAlphaCo	  0.5;
	maxDeltaT 0.0001;
	functions 
	{
				preCICE_Adapter
		{
		   type preciceAdapterFunctionObject;
			libs ("libpreciceAdapterFunctionObject.so");
		}
					preCICE_Adapter
	{
	   type preciceAdapterFunctionObject;
		libs ("libpreciceAdapterFunctionObject.so");
	}
	
	}
	// ************************************************************************* //